<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"85ed9f7fc5a837f61164a7b15ed7a51df833de24443e0f1abe4375a6e016c4ee","plan_job_ref":"Job Run Terraform plan in staging #318 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/16596268378","plan_out_hash":"a52b88c7a14a54cd1433ab43954f403171a9898e7b85ee143fad6558d4aa04f3","plan_hash":"fb598ee6c5a350570f6b99ea1b0c4085e1995dd5858ff69b6b318a6b12c76d8e","plan_text_format":"diff","version":"2.1.0","closed":true} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-05-05T21:44:14Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "continuous-monitoring-staging.app.cloud.gov" -> null
            },
-           {
-               protocol = "http1" -> null
-               route    = "rca-test.fr.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "85CebMOyURIpOCabcH5wYr/ev1DpaCoftLSPV7WLPdo=" -> "3l2sSVtjBIypQfQpUupXC7RukctbAYFXEdBHzK+1Xuk="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-06-23T13:07:24Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
!~      policies = [
!~          {
!~              destination_app = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> (known after apply)
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> (known after apply)
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (2 unchanged attributes hidden)
            },
        ]
    }

  # module.app_route[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> null
-               app_process_type = "web" -> null
-               id               = "93b25e7e-b8b8-45f6-b2f0-a30bb081f0b4" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "d95e9c29-36f0-40e3-b638-883317fe5200"
!~      updated_at   = "2025-05-09T16:45:34Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-05-05T21:38:13Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "ts-devtools-prototyping-capoc-stage-egress-egress-proxy-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "813c6a5e67dfa23721669eb59be25d14b664d44f322bb20dcc3eb1db32814e84" -> "a0772fa2c1b28879c05a844d87fcf21e0b29daf9b15c17cc26a232270ba7dea2"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-06-23T13:05:04Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.egress_proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> null
-               app_process_type = "web" -> null
-               id               = "24e55155-3a81-429b-a2ad-59871ea0380e" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "aed0ad06-a525-4ad1-9cbd-87f9d735dbb9"
!~      updated_at   = "2025-05-05T21:38:26Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Deploy Staging #117](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/16596332438)